Revit 2027 API
StructuralAsset.WoodGrade Property
 The grade of wood used in a wood-based asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string WoodGrade { get; set; }
Public Property WoodGrade As String
	Get
	Set
public:
property String^ WoodGrade {
	String^ get ();
	void set (String^ value);
}
member WoodGrade : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
InapplicableDataException |  When setting this property: the material type must be wood to set this property.
Remarks
 Applies to wood-based structural assets.
See Also
Reference
StructuralAsset Class
Autodesk.Revit.DB Namespace